## production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 12 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                              NAME                               |
|----------|-----------------------------------------------------------------|
| update   | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s`  |
|          | `aws_route53_record.api-document-notification-canada-ca-cname`  |
|          | `aws_route53_record.api-k8s-scratch-notification-CNAME`         |
|          | `aws_route53_record.api-weighted-0-scratch-notification-A`      |
|          | `aws_route53_record.doc-notification-canada-ca-cname`           |
|          | `aws_route53_record.document-notification-canada-ca-cname`      |
|          | `aws_route53_record.documentation-notification-canada-ca-cname` |
|          | `aws_route53_record.notificatio-root-WC`                        |
|          | `aws_route53_record.notification-root`                          |
|          | `aws_route53_record.notification-www-root`                      |
|          | `aws_route53_record.notification_internal_dns`                  |
|          | `aws_route53_record.wildcard_CNAME`                             |
| recreate | `aws_secretsmanager_secret_version.eks_karpenter_ami_id`        |
| add      | `time_sleep.wait_for_cert_authority`                            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
        id                     = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group-k8s"
      ~ release_version        = "1.30.2-20240904" -> "1.30.4-20240928"
        tags                   = {
            "CostCenter"             = "notification-canada-ca-production"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_route53_record.api-document-notification-canada-ca-cname will be updated in-place
  ~ resource "aws_route53_record" "api-document-notification-canada-ca-cname" {
      + allow_overwrite                  = true
        id                               = "Z1XG153PQF3VV5_api.document.notification.canada.ca_CNAME"
        name                             = "api.document.notification.canada.ca"
        # (8 unchanged attributes hidden)
    }

  # aws_route53_record.api-k8s-scratch-notification-CNAME will be updated in-place
  ~ resource "aws_route53_record" "api-k8s-scratch-notification-CNAME" {
      + allow_overwrite                  = true
        id                               = "Z1XG153PQF3VV5_api-k8s.notification.canada.ca_CNAME"
        name                             = "api-k8s.notification.canada.ca"
        # (8 unchanged attributes hidden)
    }

  # aws_route53_record.api-weighted-0-scratch-notification-A will be updated in-place
  ~ resource "aws_route53_record" "api-weighted-0-scratch-notification-A" {
      + allow_overwrite                  = true
        id                               = "Z1XG153PQF3VV5_api.notification.canada.ca_A_loadbalancer"
        name                             = "api.notification.canada.ca"
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_route53_record.doc-notification-canada-ca-cname will be updated in-place
  ~ resource "aws_route53_record" "doc-notification-canada-ca-cname" {
      + allow_overwrite                  = true
        id                               = "Z1XG153PQF3VV5_doc.notification.canada.ca_CNAME"
        name                             = "doc.notification.canada.ca"
        # (8 unchanged attributes hidden)
    }

  # aws_route53_record.document-notification-canada-ca-cname will be updated in-place
  ~ resource "aws_route53_record" "document-notification-canada-ca-cname" {
      + allow_overwrite                  = true
        id                               = "Z1XG153PQF3VV5_document.notification.canada.ca_CNAME"
        name                             = "document.notification.canada.ca"
        # (8 unchanged attributes hidden)
    }

  # aws_route53_record.documentation-notification-canada-ca-cname will be updated in-place
  ~ resource "aws_route53_record" "documentation-notification-canada-ca-cname" {
      + allow_overwrite                  = true
        id                               = "Z1XG153PQF3VV5_documentation.notification.canada.ca_CNAME"
        name                             = "documentation.notification.canada.ca"
        # (8 unchanged attributes hidden)
    }

  # aws_route53_record.notificatio-root-WC will be updated in-place
  ~ resource "aws_route53_record" "notificatio-root-WC" {
      + allow_overwrite                  = true
        id                               = "Z1XG153PQF3VV5_*.notification.canada.ca_A"
        name                             = "*.notification.canada.ca"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.notification-root will be updated in-place
  ~ resource "aws_route53_record" "notification-root" {
      + allow_overwrite                  = true
        id                               = "Z1XG153PQF3VV5_notification.canada.ca_A"
        name                             = "notification.canada.ca"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.notification-www-root will be updated in-place
  ~ resource "aws_route53_record" "notification-www-root" {
      + allow_overwrite                  = true
        id                               = "Z1XG153PQF3VV5_www.notification.canada.ca_CNAME"
        name                             = "www.notification.canada.ca"
        # (8 unchanged attributes hidden)
    }

  # aws_route53_record.notification_internal_dns will be updated in-place
  ~ resource "aws_route53_record" "notification_internal_dns" {
      + allow_overwrite                  = true
        id                               = "Z04975098KBSPJVVBZDG_production.notification.internal.com_A"
        name                             = "production.notification.internal.com"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.wildcard_CNAME will be updated in-place
  ~ resource "aws_route53_record" "wildcard_CNAME" {
      + allow_overwrite                  = true
        id                               = "Z04975098KBSPJVVBZDG_*.production.notification.internal.com_CNAME"
        name                             = "*.production.notification.internal.com"
        # (8 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n|terraform-20240912124552248500000003" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240912124552248500000003" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # time_sleep.wait_for_cert_authority will be created
  + resource "time_sleep" "wait_for_cert_authority" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

Plan: 2 to add, 12 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acmpca_certificate_authority.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
